{"pages":[{"title":"Algorithme et programme","text":"Donc pour qu'un ordinateur puisse résoudre un problème, il faut réussir à traduire ce problème sous la forme d'un algorithme. Qu'est ce qu'un algorithme? Vous avez déjà rencontré la notion d'algorithme en classe de mathématiques. Algorithme Un algorithme est une méthode, une suite d'instructions pour obtenir un résultat. Ce type de méthode est …","tags":"isnpython algorithme programme","url":"https://archives.lyceum.fr/2017-2018/isn/1-introduction-a-python/2-algorithme-et-programme"},{"title":"Quel est le but de l'ISN?","text":"Quel est le but de l'ISN? Les ordinateurs et les programmes informatiques ont pris une place prépondérante dans nos vies, et il s'agit pour nous de mieux comprendre comment ils fonctionnent, afin de savoir comment traduire nos problèmes afin qu'ils puissent les résoudre. L'objectif de l'enseignement de spécialité ISN est d'approfondir les connaissances …","tags":"isnpython introduction","url":"https://archives.lyceum.fr/2017-2018/isn/1-introduction-a-python/1-quel-est-le-but-de-lisn"},{"title":"Prise en main des logiciels","text":"Dans cette première partie, nous allons nous intéresser à la programmation web en utilisant un cours en ligne (MOOC) libre sur le site openclassroom: Apprenez à créer votre site web avec HTML5 et CSS3 Commencez par vous inscrire sur le site afin de bénéficier de toutes les fonctionnalités du cours. Vous pouvez également …","tags":"icnhtml5 css openclassroom w3c","url":"https://archives.lyceum.fr/2017-2018/icn/1-programmation-web/1-prise-en-main-des-logiciels"},{"title":"Entrées et sorties","text":"Un programme est avant tout là pour nous servir à résoudre des problèmes, l'utilisateur doit pouvoir intéragir avec celui-ci. Cela s'effectue par l'intérmédiare d'entrées et des sorties. les entrées permettent à l'utilisateur d'entrer des données dans le programme. les sorties permettent d'afficher les résultats à l'utilisateur. Entrée des données avec la fonction input …","tags":"isnpython type interpréteur print input","url":"https://archives.lyceum.fr/2017-2018/isn/1-introduction-a-python/5-entrees-et-sorties"},{"title":"Syntaxe","text":"Donc, ce que nous allons faire maintenant est de commencer à parler de Python . Et notre objectif est d'apprendre la syntaxe de ce langage, puis de l'utiliser pour apprendre comment nous pouvons traduire nos algorithmes pour résoudre un problème en une forme qui puisse être éxecutée par l'ordinateur. Pour que l'interpréteur Python puisse …","tags":"isnpython syntaxe type interpréteur","url":"https://archives.lyceum.fr/2017-2018/isn/1-introduction-a-python/3-syntaxe"},{"title":"Types","text":"Dans un programme informatique, on manipule des données sur lesquelles on effectue des calculs. Les données sont représentées sous la forme d'objets, et chaque objet a un type . En fonction du type d'objet (ou de donnée), on peut appliquer certaines opérations et d'autres non. Quelques types d'objets simples Voici quelques types simples d'objets …","tags":"isnpython syntaxe type interpréteur","url":"https://archives.lyceum.fr/2017-2018/isn/1-introduction-a-python/4-types"},{"title":"Liens et images","text":"Nous poursuivons le cours en ligne (MOOC) libre sur le site openclassroom: Apprenez à créer votre site web avec HTML5 et CSS3 N'oubliez pas de vous connecter sur le site afin de suivre votre avancement sur le cours. Pour mettre en pratique vos connaissances au fur et à mesure du cours, lancer le …","tags":"icnhtml5 openclassroom lien image","url":"https://archives.lyceum.fr/2017-2018/icn/1-programmation-web/2-liens-et-images"},{"title":"Variables et fonctions","text":"Nous avons jusqu'à maintenant utilisé l'interpréteur python comme une simple calculatrice, nous allons voir maintenant comment associer des noms a des valeurs ou à des suite d'instructions afin de rendre les programmes plus facilement lisibles et compréhensibles. Affectation d'une valeur à une variable: = Par exemple, si nous souhaitons utiliser l'intensité de la pesanteur …","tags":"isnpython syntaxe type assignation variable","url":"https://archives.lyceum.fr/2017-2018/isn/1-introduction-a-python/6-variables-et-fonctions"},{"title":"Evaluation html","text":"Nous poursuivons le cours en ligne (MOOC) libre sur le site openclassroom: Apprenez à créer votre site web avec HTML5 et CSS3 N'oubliez pas de vous connecter sur le site afin de suivre votre avancement sur le cours. 3ème séance Lors de cette troisième séance nous allons évaluer notre apprentissage des bases de …","tags":"icnhtml5 openclassroom quizz cv","url":"https://archives.lyceum.fr/2017-2018/icn/1-programmation-web/3-evaluation-html"},{"title":"Structures conditionnelles","text":"Nous avons vu la semaine dernière la notion de bloc à l'occasion de l'écriture de fonctions. Il s'agit de parties de programmes qui ne sont pas forcément exécutées à chaque lancement du programme. En python, les blocs sont délimités grâce aux tabulations et introduits grâce à deux points : . entrée dans un bloc: ligne …","tags":"isnpython structure conditionnelle if elif else","url":"https://archives.lyceum.fr/2017-2018/isn/1-introduction-a-python/7-structures-conditionnelles"},{"title":"Mise en forme avec css","text":"Nous poursuivons le cours en ligne (MOOC) libre sur le site openclassroom: Apprenez à créer votre site web avec HTML5 et CSS3 Nous commencons aujourd'hui la deuxième partie de ce cours: Partie 2 - Les joies de la mise en forme avec CSS N'oubliez pas de vous connecter sur le site afin de suivre …","tags":"icnopenclassroom css","url":"https://archives.lyceum.fr/2017-2018/icn/1-programmation-web/4-mise-en-forme-avec-css"},{"title":"Histoire de l'informatique","text":"Comment en est-on arrivé là? Nous sommes aujourd'hui entouré d'ordinateurs, de serveurs, de tablettes, et nous interagissons avec ces machines quasi- quotidiennement, mais comment cela a-t-il été possible? Comme l'explique l'article Informatique de Wikipedia, cela a été possible grâce à des avancées de nature théorique , mais aussi technologiques . Ces champs d'application[de l'informatique …","tags":"isnhistoire de l'informatique timeline.js frise chronologique","url":"https://archives.lyceum.fr/2017-2018/isn/2-architecture-des-ordinateurs-et-representation-de-linformation/1-histoire-de-linformatique"},{"title":"Polices et couleurs avec css","text":"Nous poursuivons le cours en ligne (MOOC) libre sur le site openclassroom: Apprenez à créer votre site web avec HTML5 et CSS3 Nous continuons aujourd'hui la deuxième partie de ce cours: Partie 2 - Les joies de la mise en forme avec CSS N'oubliez pas de vous connecter sur le site afin de suivre …","tags":"icnopenclassroom css","url":"https://archives.lyceum.fr/2017-2018/icn/1-programmation-web/5-polices-et-couleurs-avec-css"},{"title":"Architecture des ordinateurs","text":"Un peu d'histoire: la machine de Turing En 1642, Blaise Pascale est le premier à avoir conçu une machine à calculer mécanique, capable d'effectuer les quatre opérations élémentaires sur les entiers: addition, soustraction, multiplication, division. Par © 2005 David Monniaux / , CC BY-SA 3.0 , Lien Les machines ont ensuite évolué, afin d'être capable de …","tags":"isnhistoire de l'informatique machine Turing von Neumann","url":"https://archives.lyceum.fr/2017-2018/isn/2-architecture-des-ordinateurs-et-representation-de-linformation/2-architecture-des-ordinateurs"},{"title":"Codage de l'information en binaire","text":"Notation décimale On a l'habitude d'écrire les nombres entiers naturels en notation décimale à position , dans ce système, on écrit de droite à gauche le nombre d'unités, de paquets de dizaines, de centaines, etc. Chacun de ces nombres étant comprise entre 0 et 9, cela représente un ensemble de dix chiffres d'où …","tags":"isnreprésentation des entiers base 2 base 16","url":"https://archives.lyceum.fr/2017-2018/isn/2-architecture-des-ordinateurs-et-representation-de-linformation/3-codage-de-linformation-en-binaire"},{"title":"Bordures, ombres et dynamisme","text":"Nous poursuivons le cours en ligne (MOOC) libre sur le site openclassroom: Apprenez à créer votre site web avec HTML5 et CSS3 Nous continuons aujourd'hui la deuxième partie de ce cours: Partie 2 - Les joies de la mise en forme avec CSS N'oubliez pas de vous connecter sur le site afin de suivre …","tags":"icnopenclassroom css","url":"https://archives.lyceum.fr/2017-2018/icn/1-programmation-web/6-bordures-ombres-et-dynamisme"},{"title":"Opérations sur les entiers naturels","text":"Opérations arithmétiques Les règles utilisées en base dix s'appliquent de la même façon dans les autres bases. Addition binaire Exemple Réaliser l'addition binaire: \\(1011_2 + 1010_2\\) (1) (1) 1 0 1 1 + 1 0 1 0 ------- 1 0 1 0 1 On peut vérifier le résultat en base 10: $$({1011}_2 = 11_{10})+({1010 …","tags":"isnconversion base 2 base 16 opérations binaires","url":"https://archives.lyceum.fr/2017-2018/isn/2-architecture-des-ordinateurs-et-representation-de-linformation/4-operations-sur-les-entiers-naturels"},{"title":"Evaluation css","text":"Nous poursuivons le cours en ligne (MOOC) libre sur le site openclassroom: Apprenez à créer votre site web avec HTML5 et CSS3 N'oubliez pas de vous connecter sur le site afin de suivre votre avancement sur le cours. 7ème séance Lors de cette septième séance nous allons évaluer notre apprentissage des bases de …","tags":"icncss openclassroom quizz cv","url":"https://archives.lyceum.fr/2017-2018/icn/1-programmation-web/7-evaluation-css"},{"title":"Représentation des caractères","text":"Pour représenter un texte, il est nécessaire d'afficher les caractères qui le composent. Le choix du codage des caractères dépend fortement des langues, ainsi la langue française comporte de nombreuses lettres accentuées non utilisées en anglais par exemple: é , è , ê , ç , à ... Le premier codage à avoir été utilisé est le codage …","tags":"isncodage ASCII caractères encodage utf-8","url":"https://archives.lyceum.fr/2017-2018/isn/2-architecture-des-ordinateurs-et-representation-de-linformation/6-representation-des-caracteres"},{"title":"Représentation des entiers relatifs et des réels","text":"Dans la première partie du cours, nous avons appris à représenter des entiers naturels en représentation binaire ou hexadécimale. Ainsi en utilisant des mots de n bits, on peut coder \\(2&#94;{n}\\) nombres entiers. Cependant dans de nombreux programmes, il est nécessaire d'utiliser d'autres types de nombres comme les entiers relatifs ou les …","tags":"isnbase 2 encodage entiers relatifs nombres à virgule","url":"https://archives.lyceum.fr/2017-2018/isn/2-architecture-des-ordinateurs-et-representation-de-linformation/5-representation-des-entiers-relatifs-et-des-reels"},{"title":"Présentation de la partie programmation web","text":"Dans cette partie, nous allons voir comment créer des pages web en utilisant les trois langages du web: html : HyperText Markup Language css : Cascading StyleSheet js : JavaScript Chacun de ces langages a un rôle particulier dans la conception de la page web. Leurs syntaxes et leur possibilités ne cessent d'augmenter au fur et …","tags":"isnhtml css w3c","url":"https://archives.lyceum.fr/2017-2018/isn/3-programmation-web/1-presentation-de-la-partie-programmation-web"},{"title":"Quelques balises html utiles","text":"Cette page reprend les éléments essentiels de l'excellent cours en ligne d' OpenClassrooms : Apprenez à créer votre site web avec HTML5 et CSS3 Des liens vers le site du cours d'openClassrooms sont fournis si vous n'arrivez pas à utiliser correctement les balises proposées. Si vous avez besoin d'une référence plus complète, utilisez le …","tags":"isnhtml5 w3c balises openclassroom","url":"https://archives.lyceum.fr/2017-2018/isn/3-programmation-web/3-quelques-balises-html-utiles"},{"title":"Structure d'un document html","text":"HTML5 (HyperText Markup Language 5) est la dernière révision majeure d'HTML (format de données conçu pour représenter les pages web). Dans le langage courant, HTML5 désigne souvent un ensemble de technologies Web (HTML5, CSS3 et JavaScript) permettant notamment le développement d'applications (cf. DHTML). Source Wikipedia C'est un langage qui utilise des balises entre …","tags":"isnhtml5 w3c","url":"https://archives.lyceum.fr/2017-2018/isn/3-programmation-web/2-structure-dun-document-html"},{"title":"Présentation","text":"L'appellation « image numérique » désigne toute image (dessin, icône, photographie…) acquise, créée, traitée et stockée sous forme binaire. Source Wikipedia Types d'images il existe deux façons de coder une image numérique: le codage matriciel (bitmap en anglais) qui est un codage des couleurs des pixels . le codage vectoriel qui est un codage des formes …","tags":"icnimage vectorielle image matricielle","url":"https://archives.lyceum.fr/2017-2018/icn/2-images-numeriques/1-presentation"},{"title":"Dessin vectoriel en svg","text":"Comme nous l'avons vu précédemment , il existe deux grands types de formats d'images: les images matricielles, et les images vectorielles. Ces deux types d'images peuvent être intégrées dans une page web grâce à la balise <img> , mais elles peuvent être aussi codées directement dans la page grâce aux balises <svg> et <canvas> . Nous …","tags":"icnsvg","url":"https://archives.lyceum.fr/2017-2018/icn/2-images-numeriques/2-dessin-vectoriel-en-svg"},{"title":"Ajouter du style avec css","text":"Les feuilles de style en cascade, généralement appelées CSS de l'anglais Cascading Style Sheets, forment un langage informatique qui décrit la présentation des documents HTML et XML. Les standards définissant CSS sont publiés par le World Wide Web Consortium (W3C). Introduit au milieu des années 1990, CSS devient couramment utilisé dans la conception …","tags":"isnhtml5 css css3","url":"https://archives.lyceum.fr/2017-2018/isn/3-programmation-web/4-ajouter-du-style-avec-css"},{"title":"De l'art en svg","text":"Maintenant que vous vous êtes bien entraînés sur les techniques de base du svg avec la figure imposée proposée par le professeur en 500x500 pixels . Vous allez maintenant tenter de reproduire des œuvres de véritables peintres qui ont explorés des agencements réussis de formes et de couleurs . On peut penser notamment à... Piet …","tags":"icnsvg art Mondrian Delaunay Kandinski Wikidata","url":"https://archives.lyceum.fr/2017-2018/icn/2-images-numeriques/3-de-lart-en-svg"},{"title":"Mise en page avec html5 et css3","text":"Maintenant que vous avez vu comment intégrer des règles de styles css à votre page html , nous allons voir comment agencer de façon générale notre page en utilisant des balises html5 , ainsi que des propriétés css spécilament prévues à cet effet. Voila à quoi peut ressembler notre page web une fois mise en …","tags":"isnhtml5 css3 layout","url":"https://archives.lyceum.fr/2017-2018/isn/3-programmation-web/5-mise-en-page-avec-html5-et-css3"},{"title":"Ajouter du dynamisme avec javascript","text":"JavaScript est un langage de programmation de scripts principalement employé dans les pages web interactives mais aussi pour les serveurs. >Le langage a été créé en 1995 par Brendan Eich (Brendan Eich étant membre du conseil d'administration de la fondation Mozilla à cette époque) pour le compte de Netscape Communications Corporation. Source Wikipedia …","tags":"isnhtml5 javascript dynamique","url":"https://archives.lyceum.fr/2017-2018/isn/3-programmation-web/6-ajouter-du-dynamisme-avec-javascript"},{"title":"Le réseau internet","text":"Maintenant que nous avons vu comment créer une page web, nous allons voir comment il est possible d'accéder à des pages web à travers le réseau internet en explorant les bases des réseaux. Une vidéo pour comprendre Cette vidéo est extraite MOOC ICN sur la plateforme de cours en ligne FUN . Vidéo publiée …","tags":"isnréseaux internet","url":"https://archives.lyceum.fr/2017-2018/isn/4-architecture-des-reseaux/1-le-reseau-internet"},{"title":"Pixel art","text":"Qu'est ce que le pixel art? Nous allons maintenant nous intéresser à une branche récente des arts graphiques qui utilise des images matricielles : Le pixel art . En raison de sa source, les premiers jeux vidéos, cet art utilise une faible résolution ainsi qu'une palette de couleur réduite. Ceci permettait de réussir à charger …","tags":"icnsvg pixel art png gif gif animé","url":"https://archives.lyceum.fr/2017-2018/icn/2-images-numeriques/4-pixel-art"},{"title":"ASCII art","text":"Nous avons vu la semaine dernière comment étaient faites les images dans les premiers jeux vidéo lorsque les mémoires ne permettaient de stocker que de petites images avec une faible résolution et un nombre de couleurs limitées. Aujourd'hui nous allons encore remonter dans le temps avec des images encore plus rudimentaires lorsque les …","tags":"icnsvg ascii art encodage ASCII taille des images","url":"https://archives.lyceum.fr/2017-2018/icn/2-images-numeriques/5-ascii-art"},{"title":"Boucles","text":"Jusqu'à maintenant nous avons réalisé des programmes simples que l'interpréteur Python lisait éxecuté ligne par ligne. Nous avions également vu les structures conditionnelles if elif else qui permettent d'éxecuter certains blocs de programmes et pas d'autres en fonction de conditions, mais cependant chaque ligne du programme pouvait être exécutée au maximum une fois …","tags":"isnpython boucles for while","url":"https://archives.lyceum.fr/2017-2018/isn/5-python-avance/1-boucles"},{"title":"Types composites","text":"Dans l'introduction à Python, nous avions vu certains types de variables dits simples : int : les entiers float : les rééls(nombres à virgule flottante) boolean : booléen (Vrai ou Faux) Cependant, il existe de nombreux objets qui sont représentés par plusieurs valeurs, c'est le cas par exemple du texte, des images et des sons... Dans …","tags":"isnpython types composites chaînes de caractères listes dictionnaires","url":"https://archives.lyceum.fr/2017-2018/isn/5-python-avance/2-types-composites"},{"title":"Algorithmes de tri","text":"Maintenant que nous disposons de tableaux pour stocker de grandes quantités de données, il faut qu'on apprenne à les classer. Il existe de nombreux algorithmes de tri plus ou moins efficaces, qui sont pour la plupart répertoriées dans The Art of Computer Programming, Volume 3, Sorting and Searching. de Knuth, Donald. E. [1998 …","tags":"isnpython algorithmes de tri","url":"https://archives.lyceum.fr/2017-2018/isn/5-python-avance/3-algorithmes-de-tri"},{"title":"La dichotomie","text":"Dans cette partie, nous allons illustrer la méthode de dichotomie sur l'exemple de la recherche d'un élément dans un tableau trié. Nous verrons qu'il s'agit d'une méthode beaucoup plus efficace que le parcours complet du tableau. Elle fait partie des méthodes algorithmiques dites: \"Diviser pour régner\" La recherche dichotomique, ou recherche par dichotomie …","tags":"isnpython algorithmes de recherche dichotomie","url":"https://archives.lyceum.fr/2017-2018/isn/5-python-avance/4-la-dichotomie"},{"title":"Les ingrédients des algorithmes","text":"Dans cette partie, nous allons étudier un langage de programmation moderne le javascript qui permet notamment de créer des pages web dynamiques, qui deviennent alors de véritables applications web. Mais avant d'en arriver là, il a fallu vaincre de grandes difficultés tant théoriques que technologiques. La machine analytique(1821) Cette machine imaginée par …","tags":"icnalgorithme programmation par bloc","url":"https://archives.lyceum.fr/2017-2018/icn/3-programmation-en-javascript/1-les-ingredients-des-algorithmes"},{"title":"Types et variables","text":"Pour apprendre à coder en javascript , nous allons suivre le cours en ligne (MOOC) libre sur le site openclassroom: Apprenez à coder avec JavaScript N'oubliez pas de vous connecter sur le site afin de suivre votre avancement sur le cours. Pour mettre en pratique vos connaissances au fur et à mesure du cours …","tags":"icnopenclassroom javascript","url":"https://archives.lyceum.fr/2017-2018/icn/3-programmation-en-javascript/2-types-et-variables"}]}